IDENTIFICATION DIVISION.
PROGRAM-ID. SSPP2.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    DECIMAL-POINT IS COMMA.

DATA DIVISION.
WORKING-STORAGE SECTION.

01  WS-JOUR         PIC X(2).
01  WS-MOIS         PIC X(2).
01  WS-ANNEE        PIC X(4).

LINKAGE SECTION.
01  WS-DATE         PIC X(10).
01  RESULT          PIC X(10).

PROCEDURE DIVISION USING WS-DATE, RESULT.

    IF  WS-DATE(3:1) =  '/' AND WS-DATE(6:1) = '/'
        MOVE WS-DATE(1:2) TO WS-JOUR
        MOVE WS-DATE(4:2) TO WS-MOIS
        MOVE WS-DATE(7:4) TO WS-ANNEE
        MOVE WS-ANNEE TO RESULT(1:4)
        MOVE '-'      TO RESULT(5:1)
        MOVE WS-MOIS  TO RESULT(6:2)
        MOVE '-'      TO RESULT(8:1)
        MOVE WS-JOUR  TO RESULT(9:2)
    ELSE
        MOVE 'ERREURDATE' TO RESULT
    END-IF

    GOBACK.
