000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ASSEQ.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 LINKAGE SECTION.
000700     COPY TESTCONT.
000800 01 TEST-NAME PIC X(30).
000900 01 EXPECTED  PIC 9(3)V99.
001000 01 ACTUAL    PIC 9(3)V99.
001100 PROCEDURE DIVISION USING TEST-CONTEXT, TEST-NAME,
001200                                EXPECTED, ACTUAL.
001210     DISPLAY 'RESULTAT EXPECT : ' EXPECTED
001220     DISPLAY 'RESULTAT ACUTAL : ' ACTUAL
001230
001240
001300     ADD 1 TO TESTS-RUN
001400     IF ACTUAL = EXPECTED THEN
001500              ADD 1 TO PASSES
001600     ELSE
001700              DISPLAY 'FAILED : ' TEST-NAME
001800              DISPLAY 'EXPECTED ' EXPECTED
001900              DISPLAY 'ACTUAL : ' ACTUAL
002000
002100              ADD 1 TO FAILURES
002200     END-IF
002300
002400     GOBACK.
