000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CONVERT.
000300
000310 ENVIRONMENT DIVISION.
000320 CONFIGURATION SECTION.
000330 SPECIAL-NAMES.
000340     DECIMAL-POINT IS COMMA.
000350
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600
000700 LINKAGE SECTION.
000800 01  WS-DEVISE       PIC X(2).
000810 01  WS-PRICE        PIC 9(3)V99.
000900 01  RESULT          PIC 9(3)V99.
001000
001100 PROCEDURE DIVISION USING WS-DEVISE, WS-PRICE, RESULT.
001110
001200     EVALUATE WS-DEVISE
001300      WHEN 'EU'
001400       COMPUTE RESULT = WS-PRICE * 1,06
001500      WHEN 'DO'
001600       COMPUTE RESULT = WS-PRICE
001700      WHEN 'YU'
001800       COMPUTE RESULT = WS-PRICE * 0,14
001900      WHEN OTHER
002000       COMPUTE RESULT = 0
002100      END-EVALUATE
002200
002300      GOBACK.
