//JCEX1TU  JOB (ACCT£),'YOUNES',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,COND=(4,LT)
//*
//*  ETAPE DE COMPILATION
//*
//COMPIL   EXEC IGYWCL,PARM.COBOL=(ADV,OBJECT,LIB,TEST,APOST)
//COBOL.SYSIN  DD DSN=API15.SOURCE.DB2(COBEX1TU),DISP=SHR
//COBOL.SYSLIB DD DSN=CEE.SCEESAMP,DISP=SHR
//             DD DSN=API15.SOURCE.COPY,DISP=SHR
//*
//*  ETAPE DE LINKEDIT
//*
//LKED.SYSLIB  DD DSN=API15.COBOL.LOAD,DISP=SHR
//LKED.SYSLMOD DD DSN=API15.COBOL.LOAD,DISP=(SHR,KEEP,KEEP)
//LKED.SYSIN DD *
 INCLUDE SYSLIB('ASSEQ')
 INCLUDE SYSLIB('CONVERT')
 NAME COBEX1TU(R)
/*
