//JEEX1TU  JOB (ACCT£),'YOUNES',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,TIME=(0,30)
//******************************************************
//*  ETAPE D'EXECUTION
//******************************************************
//JEXEC    EXEC PGM=COBEX1TU
//STEPLIB  DD DSN=API15.COBOL.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
